Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Saheeh International.tmx
Source language: ar
Languages: en

source: وجعلنا الليل والنهار آيتين فمحونا آية الليل وجعلنا آية النهار مبصرة لتبتغوا فضلا من ربكم ولتعلموا عدد السنين والحساب وكل شيء فصلناه تفصيلا
en: And We have made the night and day two signs, and We erased the sign of the night and made the sign of the day visible that you may seek bounty from your Lord and may know the number of years and the account [of time]. And everything We have set out in detail.

source: وكل إنسان ألزمناه طائره في عنقه ونخرج له يوم القيامة كتابا يلقاه منشورا
en: And [for] every person We have imposed his fate upon his neck, and We will produce for him on the Day of Resurrection a record which he will encounter spread open.

source: اقرأ كتابك كفى بنفسك اليوم عليك حسيبا
en: [It will be said], "Read your record. Sufficient is yourself against you this Day as accountant."

source: من اهتدى فإنما يهتدي لنفسه ومن ضل فإنما يضل عليها ولا تزر وازرة وزر أخرى وما كنا معذبين حتى نبعث رسولا
en: Whoever is guided is only guided for [the benefit of] his soul. And whoever errs only errs against it. And no bearer of burdens will bear the burden of another. And never would We punish until We sent a messenger.

source: وإذا أردنا أن نهلك قرية أمرنا مترفيها ففسقوا فيها فحق عليها القول فدمرناها تدميرا
en: And when We intend to destroy a city, We command its affluent but they defiantly disobey therein; so the word comes into effect upon it, and We destroy it with [complete] destruction.

source: وكم أهلكنا من القرون من بعد نوح وكفى بربك بذنوب عباده خبيرا بصيرا
en: And how many have We destroyed from the generations after Noah. And sufficient is your Lord, concerning the sins of His servants, as Acquainted and Seeing.

source: من كان يريد العاجلة عجلنا له فيها ما نشاء لمن نريد ثم جعلنا له جهنم يصلاها مذموما مدحورا
en: Whoever should desire the immediate - We hasten for him from it what We will to whom We intend. Then We have made for him Hell, which he will [enter to] burn, censured and banished.

source: ومن أراد الآخرة وسعى لها سعيها وهو مؤمن فأولئك كان سعيهم مشكورا
en: But whoever desires the Hereafter and exerts the effort due to it while he is a believer - it is those whose effort is ever appreciated [by Allah].

source: كلا نمد هؤلاء وهؤلاء من عطاء ربك وما كان عطاء ربك محظورا
en: To each [category] We extend - to these and to those - from the gift of your Lord. And never has the gift of your Lord been restricted.

source: انظر كيف فضلنا بعضهم على بعض وللآخرة أكبر درجات وأكبر تفضيلا
en: Look how We have favored [in provision] some of them over others. But the Hereafter is greater in degrees [of difference] and greater in distinction.

source: لا تجعل مع الله إلها آخر فتقعد مذموما مخذولا
en: Do not make [as equal] with Allah another deity and [thereby] become censured and forsaken.

source: وقضى ربك ألا تعبدوا إلا إياه وبالوالدين إحسانا إما يبلغن عندك الكبر أحدهما أو كلاهما فلا تقل لهما أف ولا تنهرهما وقل لهما قولا كريما
en: And your Lord has decreed that you not worship except Him, and to parents, good treatment. Whether one or both of them reach old age [while] with you, say not to them [so much as], "uff," and do not repel them but speak to them a noble word.

source: واخفض لهما جناح الذل من الرحمة وقل رب ارحمهما كما ربياني صغيرا
en: And lower to them the wing of humility out of mercy and say, "My Lord, have mercy upon them as they brought me up [when I was] small."

source: ربكم أعلم بما في نفوسكم إن تكونوا صالحين فإنه كان للأوابين غفورا
en: Your Lord is most knowing of what is within yourselves. If you should be righteous [in intention] - then indeed He is ever, to the often returning [to Him], Forgiving.

source: وآت ذا القربى حقه والمسكين وابن السبيل ولا تبذر تبذيرا
en: And give the relative his right, and [also] the poor and the traveler, and do not spend wastefully.

source: إن المبذرين كانوا إخوان الشياطين وكان الشيطان لربه كفورا
en: Indeed, the wasteful are brothers of the devils, and ever has Satan been to his Lord ungrateful.

source: وإما تعرضن عنهم ابتغاء رحمة من ربك ترجوها فقل لهم قولا ميسورا
en: And if you [must] turn away from the needy awaiting mercy from your Lord which you expect, then speak to them a gentle word.

source: ولا تجعل يدك مغلولة إلى عنقك ولا تبسطها كل البسط فتقعد ملوما محسورا
en: And do not make your hand [as] chained to your neck or extend it completely and [thereby] become blamed and insolvent.

source: إن ربك يبسط الرزق لمن يشاء ويقدر إنه كان بعباده خبيرا بصيرا
en: Indeed, your Lord extends provision for whom He wills and restricts [it]. Indeed He is ever, concerning His servants, Acquainted and Seeing.

source: ولا تقتلوا أولادكم خشية إملاق نحن نرزقهم وإياكم إن قتلهم كان خطئا كبيرا
en: And do not kill your children for fear of poverty. We provide for them and for you. Indeed, their killing is ever a great sin.

source: ولا تقربوا الزنا إنه كان فاحشة وساء سبيلا
en: And do not approach unlawful sexual intercourse. Indeed, it is ever an immorality and is evil as a way.

source: ولا تقتلوا النفس التي حرم الله إلا بالحق ومن قتل مظلوما فقد جعلنا لوليه سلطانا فلا يسرف في القتل إنه كان منصورا
en: And do not kill the soul which Allah has forbidden, except by right. And whoever is killed unjustly - We have given his heir authority, but let him not exceed limits in [the matter of] taking life. Indeed, he has been supported [by the law].

source: ولا تقربوا مال اليتيم إلا بالتي هي أحسن حتى يبلغ أشده وأوفوا بالعهد إن العهد كان مسئولا
en: And do not approach the property of an orphan, except in the way that is best, until he reaches maturity. And fulfill [every] commitment. Indeed, the commitment is ever [that about which one will be] questioned.

source: وأوفوا الكيل إذا كلتم وزنوا بالقسطاس المستقيم ذلك خير وأحسن تأويلا
en: And give full measure when you measure, and weigh with an even balance. That is the best [way] and best in result.

source: ولا تقف ما ليس لك به علم إن السمع والبصر والفؤاد كل أولئك كان عنه مسئولا
en: And do not pursue that of which you have no knowledge. Indeed, the hearing, the sight and the heart - about all those [one] will be questioned.

source: ولا تمش في الأرض مرحا إنك لن تخرق الأرض ولن تبلغ الجبال طولا
en: And do not walk upon the earth exultantly. Indeed, you will never tear the earth [apart], and you will never reach the mountains in height.

source: كل ذلك كان سيئه عند ربك مكروها
en: All that - its evil is ever, in the sight of your Lord, detested.

source: ذلك مما أوحى إليك ربك من الحكمة ولا تجعل مع الله إلها آخر فتلقى في جهنم ملوما مدحورا
en: That is from what your Lord has revealed to you, [O Muhammad], of wisdom. And, [O mankind], do not make [as equal] with Allah another deity, lest you be thrown into Hell, blamed and banished.

source: أفأصفاكم ربكم بالبنين واتخذ من الملائكة إناثا إنكم لتقولون قولا عظيما
en: Then, has your Lord chosen you for [having] sons and taken from among the angels daughters? Indeed, you say a grave saying.

source: ولقد صرفنا في هذا القرآن ليذكروا وما يزيدهم إلا نفورا
en: And We have certainly diversified [the contents] in this Qur'an that mankind may be reminded, but it does not increase the disbelievers except in aversion.

source: قل لو كان معه آلهة كما يقولون إذا لابتغوا إلى ذي العرش سبيلا
en: Say, [O Muhammad], "If there had been with Him [other] gods, as they say, then they [each] would have sought to the Owner of the Throne a way."

source: سبحانه وتعالى عما يقولون علوا كبيرا
en: Exalted is He and high above what they say by great sublimity.

source: تسبح له السماوات السبع والأرض ومن فيهن وإن من شيء إلا يسبح بحمده ولكن لا تفقهون تسبيحهم إنه كان حليما غفورا
en: The seven heavens and the earth and whatever is in them exalt Him. And there is not a thing except that it exalts [Allah] by His praise, but you do not understand their [way of] exalting. Indeed, He is ever Forbearing and Forgiving.

source: وإذا قرأت القرآن جعلنا بينك وبين الذين لا يؤمنون بالآخرة حجابا مستورا
en: And when you recite the Qur'an, We put between you and those who do not believe in the Hereafter a concealed partition.

source: وجعلنا على قلوبهم أكنة أن يفقهوه وفي آذانهم وقرا وإذا ذكرت ربك في القرآن وحده ولوا على أدبارهم نفورا
en: And We have placed over their hearts coverings, lest they understand it, and in their ears deafness. And when you mention your Lord alone in the Qur'an, they turn back in aversion.

source: نحن أعلم بما يستمعون به إذ يستمعون إليك وإذ هم نجوى إذ يقول الظالمون إن تتبعون إلا رجلا مسحورا
en: We are most knowing of how they listen to it when they listen to you and [of] when they are in private conversation, when the wrongdoers say, "You follow not but a man affected by magic."

source: انظر كيف ضربوا لك الأمثال فضلوا فلا يستطيعون سبيلا
en: Look how they strike for you comparisons; but they have strayed, so they cannot [find] a way.

source: وقالوا أإذا كنا عظاما ورفاتا أإنا لمبعوثون خلقا جديدا
en: And they say, "When we are bones and crumbled particles, will we [truly] be resurrected as a new creation?"

source: قل كونوا حجارة أو حديدا
en: Say, "Be you stones or iron

source: أو خلقا مما يكبر في صدوركم فسيقولون من يعيدنا قل الذي فطركم أول مرة فسينغضون إليك رءوسهم ويقولون متى هو قل عسى أن يكون قريبا
en: Or [any] creation of that which is great within your breasts." And they will say, "Who will restore us?" Say, "He who brought you forth the first time." Then they will nod their heads toward you and say, "When is that?" Say, "Perhaps it will be soon -

source: يوم يدعوكم فتستجيبون بحمده وتظنون إن لبثتم إلا قليلا
en: On the Day He will call you and you will respond with praise of Him and think that you had not remained [in the world] except for a little."

source: وقل لعبادي يقولوا التي هي أحسن إن الشيطان ينزغ بينهم إن الشيطان كان للإنسان عدوا مبينا
en: And tell My servants to say that which is best. Indeed, Satan induces [dissension] among them. Indeed Satan is ever, to mankind, a clear enemy.

source: ربكم أعلم بكم إن يشأ يرحمكم أو إن يشأ يعذبكم وما أرسلناك عليهم وكيلا
en: Your Lord is most knowing of you. If He wills, He will have mercy upon you; or if He wills, He will punish you. And We have not sent you, [O Muhammad], over them as a manager.

source: وربك أعلم بمن في السماوات والأرض ولقد فضلنا بعض النبيين على بعض وآتينا داوود زبورا
en: And your Lord is most knowing of whoever is in the heavens and the earth. And We have made some of the prophets exceed others [in various ways], and to David We gave the book [of Psalms].

source: قل ادعوا الذين زعمتم من دونه فلا يملكون كشف الضر عنكم ولا تحويلا
en: Say, "Invoke those you have claimed [as gods] besides Him, for they do not possess the [ability for] removal of adversity from you or [for its] transfer [to someone else]."

source: أولئك الذين يدعون يبتغون إلى ربهم الوسيلة أيهم أقرب ويرجون رحمته ويخافون عذابه إن عذاب ربك كان محذورا
en: Those whom they invoke seek means of access to their Lord, [striving as to] which of them would be nearest, and they hope for His mercy and fear His punishment. Indeed, the punishment of your Lord is ever feared.

source: وإن من قرية إلا نحن مهلكوها قبل يوم القيامة أو معذبوها عذابا شديدا كان ذلك في الكتاب مسطورا
en: And there is no city but that We will destroy it before the Day of Resurrection or punish it with a severe punishment. That has ever been in the Register inscribed.

source: وما منعنا أن نرسل بالآيات إلا أن كذب بها الأولون وآتينا ثمود الناقة مبصرة فظلموا بها وما نرسل بالآيات إلا تخويفا
en: And nothing has prevented Us from sending signs except that the former peoples denied them. And We gave Thamud the she-camel as a visible sign, but they wronged her. And We send not the signs except as a warning.

source: وإذ قلنا لك إن ربك أحاط بالناس وما جعلنا الرؤيا التي أريناك إلا فتنة للناس والشجرة الملعونة في القرآن ونخوفهم فما يزيدهم إلا طغيانا كبيرا
en: And [remember, O Muhammad], when We told you, "Indeed, your Lord has encompassed the people." And We did not make the sight which We showed you except as a trial for the people, as was the accursed tree [mentioned] in the Qur'an. And We threaten them, but it increases them not except in great transgression.

source: وإذ قلنا للملائكة اسجدوا لآدم فسجدوا إلا إبليس قال أأسجد لمن خلقت طينا
en: And [mention] when We said to the angles, "Prostrate to Adam," and they prostrated, except for Iblees. He said, "Should I prostrate to one You created from clay?"

source: قال أرأيتك هذا الذي كرمت علي لئن أخرتن إلى يوم القيامة لأحتنكن ذريته إلا قليلا
en: [Iblees] said, "Do You see this one whom You have honored above me? If You delay me until the Day of Resurrection, I will surely destroy his descendants, except for a few."

source: قال اذهب فمن تبعك منهم فإن جهنم جزاؤكم جزاء موفورا
en: [Allah] said, "Go, for whoever of them follows you, indeed Hell will be the recompense of you - an ample recompense.

source: واستفزز من استطعت منهم بصوتك وأجلب عليهم بخيلك ورجلك وشاركهم في الأموال والأولاد وعدهم وما يعدهم الشيطان إلا غرورا
en: And incite [to senselessness] whoever you can among them with your voice and assault them with your horses and foot soldiers and become a partner in their wealth and their children and promise them." But Satan does not promise them except delusion.

source: إن عبادي ليس لك عليهم سلطان وكفى بربك وكيلا
en: Indeed, over My [believing] servants there is for you no authority. And sufficient is your Lord as Disposer of affairs.

source: ربكم الذي يزجي لكم الفلك في البحر لتبتغوا من فضله إنه كان بكم رحيما
en: It is your Lord who drives the ship for you through the sea that you may seek of His bounty. Indeed, He is ever, to you, Merciful.

source: وإذا مسكم الضر في البحر ضل من تدعون إلا إياه فلما نجاكم إلى البر أعرضتم وكان الإنسان كفورا
en: And when adversity touches you at sea, lost are [all] those you invoke except for Him. But when He delivers you to the land, you turn away [from Him]. And ever is man ungrateful.

source: أفأمنتم أن يخسف بكم جانب البر أو يرسل عليكم حاصبا ثم لا تجدوا لكم وكيلا
en: Then do you feel secure that [instead] He will not cause a part of the land to swallow you or send against you a storm of stones? Then you would not find for yourselves an advocate.

source: أم أمنتم أن يعيدكم فيه تارة أخرى فيرسل عليكم قاصفا من الريح فيغرقكم بما كفرتم ثم لا تجدوا لكم علينا به تبيعا
en: Or do you feel secure that He will not send you back into the sea another time and send upon you a hurricane of wind and drown you for what you denied? Then you would not find for yourselves against Us an avenger.

source: ولقد كرمنا بني آدم وحملناهم في البر والبحر ورزقناهم من الطيبات وفضلناهم على كثير ممن خلقنا تفضيلا
en: And We have certainly honored the children of Adam and carried them on the land and sea and provided for them of the good things and preferred them over much of what We have created, with [definite] preference.

source: يوم ندعو كل أناس بإمامهم فمن أوتي كتابه بيمينه فأولئك يقرءون كتابهم ولا يظلمون فتيلا
en: [Mention, O Muhammad], the Day We will call forth every people with their record [of deeds]. Then whoever is given his record in his right hand - those will read their records, and injustice will not be done to them, [even] as much as a thread [inside the date seed].

source: ومن كان في هذه أعمى فهو في الآخرة أعمى وأضل سبيلا
en: And whoever is blind in this [life] will be blind in the Hereafter and more astray in way.

source: وإن كادوا ليفتنونك عن الذي أوحينا إليك لتفتري علينا غيره وإذا لاتخذوك خليلا
en: And indeed, they were about to tempt you away from that which We revealed to you in order to [make] you invent about Us something else; and then they would have taken you as a friend.

source: ولولا أن ثبتناك لقد كدت تركن إليهم شيئا قليلا
en: And if We had not strengthened you, you would have almost inclined to them a little.

source: إذا لأذقناك ضعف الحياة وضعف الممات ثم لا تجد لك علينا نصيرا
en: Then [if you had], We would have made you taste double [punishment in] life and double [after] death. Then you would not find for yourself against Us a helper.

source: وإن كادوا ليستفزونك من الأرض ليخرجوك منها وإذا لا يلبثون خلافك إلا قليلا
en: And indeed, they were about to drive you from the land to evict you therefrom. And then [when they do], they will not remain [there] after you, except for a little.

source: سنة من قد أرسلنا قبلك من رسلنا ولا تجد لسنتنا تحويلا
en: [That is Our] established way for those We had sent before you of Our messengers; and you will not find in Our way any alteration.

source: أقم الصلاة لدلوك الشمس إلى غسق الليل وقرآن الفجر إن قرآن الفجر كان مشهودا
en: Establish prayer at the decline of the sun [from its meridian] until the darkness of the night and [also] the Qur'an of dawn. Indeed, the recitation of dawn is ever witnessed.

source: ومن الليل فتهجد به نافلة لك عسى أن يبعثك ربك مقاما محمودا
en: And from [part of] the night, pray with it as additional [worship] for you; it is expected that your Lord will resurrect you to a praised station.

source: وقل رب أدخلني مدخل صدق وأخرجني مخرج صدق واجعل لي من لدنك سلطانا نصيرا
en: And say, "My Lord, cause me to enter a sound entrance and to exit a sound exit and grant me from Yourself a supporting authority."

source: وقل جاء الحق وزهق الباطل إن الباطل كان زهوقا
en: And say, "Truth has come, and falsehood has departed. Indeed is falsehood, [by nature], ever bound to depart."

source: وننزل من القرآن ما هو شفاء ورحمة للمؤمنين ولا يزيد الظالمين إلا خسارا
en: And We send down of the Qur'an that which is healing and mercy for the believers, but it does not increase the wrongdoers except in loss.

source: وإذا أنعمنا على الإنسان أعرض ونأى بجانبه وإذا مسه الشر كان يئوسا
en: And when We bestow favor upon the disbeliever, he turns away and distances himself; and when evil touches him, he is ever despairing.

source: قل كل يعمل على شاكلته فربكم أعلم بمن هو أهدى سبيلا
en: Say, "Each works according to his manner, but your Lord is most knowing of who is best guided in way."

source: ويسألونك عن الروح قل الروح من أمر ربي وما أوتيتم من العلم إلا قليلا
en: And they ask you, [O Muhammad], about the soul. Say, "The soul is of the affair of my Lord. And mankind have not been given of knowledge except a little."

source: ولئن شئنا لنذهبن بالذي أوحينا إليك ثم لا تجد لك به علينا وكيلا
en: And if We willed, We could surely do away with that which We revealed to you. Then you would not find for yourself concerning it an advocate against Us.

source: إلا رحمة من ربك إن فضله كان عليك كبيرا
en: Except [We have left it with you] as a mercy from your Lord. Indeed, His favor upon you has ever been great.

source: قل لئن اجتمعت الإنس والجن على أن يأتوا بمثل هذا القرآن لا يأتون بمثله ولو كان بعضهم لبعض ظهيرا
en: Say, "If mankind and the jinn gathered in order to produce the like of this Qur'an, they could not produce the like of it, even if they were to each other assistants."

source: ولقد صرفنا للناس في هذا القرآن من كل مثل فأبى أكثر الناس إلا كفورا
en: And We have certainly diversified for the people in this Qur'an from every [kind] of example, but most of the people refused [anything] except disbelief.

source: وقالوا لن نؤمن لك حتى تفجر لنا من الأرض ينبوعا
en: And they say, "We will not believe you until you break open for us from the ground a spring.

source: أو تكون لك جنة من نخيل وعنب فتفجر الأنهار خلالها تفجيرا
en: Or [until] you have a garden of palm tress and grapes and make rivers gush forth within them in force [and abundance]

source: أو تسقط السماء كما زعمت علينا كسفا أو تأتي بالله والملائكة قبيلا
en: Or you make the heaven fall upon us in fragments as you have claimed or you bring Allah and the angels before [us]

source: أو يكون لك بيت من زخرف أو ترقى في السماء ولن نؤمن لرقيك حتى تنزل علينا كتابا نقرؤه قل سبحان ربي هل كنت إلا بشرا رسولا
en: Or you have a house of gold or you ascend into the sky. And [even then], we will not believe in your ascension until you bring down to us a book we may read." Say, "Exalted is my Lord! Was I ever but a human messenger?"

source: وما منع الناس أن يؤمنوا إذ جاءهم الهدى إلا أن قالوا أبعث الله بشرا رسولا
en: And what prevented the people from believing when guidance came to them except that they said, "Has Allah sent a human messenger?"

source: قل لو كان في الأرض ملائكة يمشون مطمئنين لنزلنا عليهم من السماء ملكا رسولا
en: Say, "If there were upon the earth angels walking securely, We would have sent down to them from the heaven an angel [as a] messenger."

source: قل كفى بالله شهيدا بيني وبينكم إنه كان بعباده خبيرا بصيرا
en: Say, "Sufficient is Allah as Witness between me and you. Indeed he is ever, concerning His servants, Acquainted and Seeing."

source: ومن يهد الله فهو المهتد ومن يضلل فلن تجد لهم أولياء من دونه ونحشرهم يوم القيامة على وجوههم عميا وبكما وصما مأواهم جهنم كلما خبت زدناهم سعيرا
en: And whoever Allah guides - he is the [rightly] guided; and whoever He sends astray - you will never find for them protectors besides Him, and We will gather them on the Day of Resurrection [fallen] on their faces - blind, dumb and deaf. Their refuge is Hell; every time it subsides We increase them in blazing fire.

source: ذلك جزاؤهم بأنهم كفروا بآياتنا وقالوا أإذا كنا عظاما ورفاتا أإنا لمبعوثون خلقا جديدا
en: That is their recompense because they disbelieved in Our verses and said, "When we are bones and crumbled particles, will we [truly] be resurrected [in] a new creation?"

source: أولم يروا أن الله الذي خلق السماوات والأرض قادر على أن يخلق مثلهم وجعل لهم أجلا لا ريب فيه فأبى الظالمون إلا كفورا
en: Do they not see that Allah, who created the heavens and earth, is [the one] Able to create the likes of them? And He has appointed for them a term, about which there is no doubt. But the wrongdoers refuse [anything] except disbelief.

source: قل لو أنتم تملكون خزائن رحمة ربي إذا لأمسكتم خشية الإنفاق وكان الإنسان قتورا
en: Say [to them], "If you possessed the depositories of the mercy of my Lord, then you would withhold out of fear of spending." And ever has man been stingy.

source: ولقد آتينا موسى تسع آيات بينات فاسأل بني إسرائيل إذ جاءهم فقال له فرعون إني لأظنك يا موسى مسحورا
en: And We had certainly given Moses nine evident signs, so ask the Children of Israel [about] when he came to them and Pharaoh said to him, "Indeed I think, O Moses, that you are affected by magic."

source: قال لقد علمت ما أنزل هؤلاء إلا رب السماوات والأرض بصائر وإني لأظنك يا فرعون مثبورا
en: [Moses] said, "You have already known that none has sent down these [signs] except the Lord of the heavens and the earth as evidence, and indeed I think, O Pharaoh, that you are destroyed."

source: فأراد أن يستفزهم من الأرض فأغرقناه ومن معه جميعا
en: So he intended to drive them from the land, but We drowned him and those with him all together.

source: وقلنا من بعده لبني إسرائيل اسكنوا الأرض فإذا جاء وعد الآخرة جئنا بكم لفيفا
en: And We said after Pharaoh to the Children of Israel, "Dwell in the land, and when there comes the promise of the Hereafter, We will bring you forth in [one] gathering."

source: وبالحق أنزلناه وبالحق نزل وما أرسلناك إلا مبشرا ونذيرا
en: And with the truth We have sent the Qur'an down, and with the truth it has descended. And We have not sent you, [O Muhammad], except as a bringer of good tidings and a warner.

source: وقرآنا فرقناه لتقرأه على الناس على مكث ونزلناه تنزيلا
en: And [it is] a Qur'an which We have separated [by intervals] that you might recite it to the people over a prolonged period. And We have sent it down progressively.

source: قل آمنوا به أو لا تؤمنوا إن الذين أوتوا العلم من قبله إذا يتلى عليهم يخرون للأذقان سجدا
en: Say, "Believe in it or do not believe. Indeed, those who were given knowledge before it - when it is recited to them, they fall upon their faces in prostration,

source: ويقولون سبحان ربنا إن كان وعد ربنا لمفعولا
en: And they say, "Exalted is our Lord! Indeed, the promise of our Lord has been fulfilled."

source: ويخرون للأذقان يبكون ويزيدهم خشوعا
en: And they fall upon their faces weeping, and the Qur'an increases them in humble submission.
